# PointLightShape Constructor (PointLightShape)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointLightShape Constructor (PointLightShape)
PointLightShape Class See Also
---
Creates a copy of the given point light shape
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PointLightShape(
	PointLightShape other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As PointLightShape _
)
```

Visual C++
---
```text
public:
PointLightShape(
	PointLightShape^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..PointLightShape
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointLightShape Class
PointLightShape Overload
Autodesk.Revit.DB.Lighting Namespace